# Pandas  - Dataframe and Series
it is a data manipulation library , widely used for data analysis and data cleaning. It provides two primary data structurs, Series and Dataframe . 
Series is a 1-d array like object,while a Dataframe is a 2d , size mutable and potentially heterogenous tabular data structure with labeled axes (rows and cols)

!pip insa

In [ ]:
!pip install pandas   # install pandas library

Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\gagan\appdata\roaming\python\python312\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\gagan\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\gagan\appdata\roaming\python\python312\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\gagan\appdata\roaming\python\python312\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\gagan\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.0 MB 1.1 MB/s eta 0:00:10
   -- ------------------------------------- 0.8/11.0 MB 1.4 MB/s eta 0:00:08
   ---- ----------------------------------- 1.3/11.0 MB 1.6 MB/s eta 0:00:06
   ----- ---------------------------------- 1.6/11.0 MB 1.6 MB/s eta 0:00:06
   ------- -------------------------------- 2.1/11.0 MB 1.7 MB/s eta 0:00:06
   -------- ------------------------------- 2.4/11.0 MB 1.7 MB/s eta 0:00:06
   --------- ------------------------------ 2.6/11.0 MB 1.7 MB/s eta 0:00:05
   ----------- ---------------------------- 3.1/11.0 MB 1.6 MB/s eta 0:00:05
   ------------ --------------------------- 3.4/11.0 MB 1.7 MB/s eta 0:00:05
   -------------- ------------------------- 3.9/11.0 MB 1.7 MB/s eta 0:00:05
   --------------- ------------------------ 4.2/11.0 MB 1.7 MB/s eta 0:00:04
   ---------------- ----------------------- 4.5/11.0 MB 1.7 MB/s eta 0:00:04
   ------------------ --------------------- 5.0/11.0 MB 1.7 MB/s eta 0:00:04
   ------------------- -------------------- 5.2/11.0 MB 1.7 MB/s eta 0:00:04
   -------------------- ------------------- 5.5/11.0 MB 1.7 MB/s eta 0:00:04
   --------------------- ------------------ 6.0/11.0 MB 1.7 MB/s eta 0:00:03
   ---------------------- ----------------- 6.3/11.0 MB 1.7 MB/s eta 0:00:03
   ------------------------ --------------- 6.8/11.0 MB 1.7 MB/s eta 0:00:03
   ------------------------- -------------- 7.1/11.0 MB 1.7 MB/s eta 0:00:03
   -------------------------- ------------- 7.3/11.0 MB 1.7 MB/s eta 0:00:03
   --------------------------- ------------ 7.6/11.0 MB 1.7 MB/s eta 0:00:03
   ---------------------------- ----------- 7.9/11.0 MB 1.7 MB/s eta 0:00:02
   ----------------------------- ---------- 8.1/11.0 MB 1.7 MB/s eta 0:00:02
   ------------------------------- -------- 8.7/11.0 MB 1.7 MB/s eta 0:00:02
   -------------------------------- ------- 8.9/11.0 MB 1.7 MB/s eta 0:00:02
   --------------------------------- ------ 9.2/11.0 MB 1.7 MB/s eta 0:00:02
   ---------------------------------- ----- 9.4/11.0 MB 1.7 MB/s eta 0:00:01
   ------------------------------------ --- 10.0/11.0 MB 1.6 MB/s eta 0:00:01
   ------------------------------------- -- 10.2/11.0 MB 1.6 MB/s eta 0:00:01
   -------------------------------------- - 10.5/11.0 MB 1.6 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 1.6 MB/s eta 0:00:00
Installing collected packages: pandas
Successfully installed pandas-2.3.3

In [3]:
import pandas as pd  # import pandas with alias pd

In [2]:
# Series
## A pandas Series is a one-dimensional array-like object that can hold any data type.
#  It is similar to a column in a spreadsheet or a database table.

import pandas as pd
data=[1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)  # in output the left sides are indexes not wry abt them

print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
# dictionaries to series
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)     # u will see that key becomes the index for it

a    1
b    2
c    3
dtype: int64

In [5]:
# another way to create series
data = [10, 20, 30, 40, 50]
index = ['a', 'b', 'c', 'd', 'e']
pd.Series(data, index=index)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [14]:
## DataFrame is just like a table with rows and columns.

# create a DataFrame from a dictionary of list 

data={
    'Name':['Kri','joh','jac'],
    'Age':[25,30,45],
    'City':['bangalore','Delhi','jaipur']
}
df=pd.DataFrame(data)
print(df)

  Name  Age       City
0  Kri   25  bangalore
1  joh   30      Delhi
2  jac   45     jaipur

In [9]:
# create a dataframe from list[] of dictionaries{}

data=[
     {'Name':'Tris','Age':78,'City':"Bang"},
     {'Name':'Nicohl','Age':78,'City':"Bang"},
     {'Name':'rock','Age':78,'City':"Bang"},
     {'Name':'Jac','Age':78,'City':"Bang"},
]

df=pd.DataFrame(data)
print(df)

     Name  Age  City
0    Tris   78  Bang
1  Nicohl   78  Bang
2    rock   78  Bang
3     Jac   78  Bang

In [10]:
# CSV READING
df=pd.read_csv('sales_data.csv')
df.head(5)            # to see 5 entries from top

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [11]:
df.tail(5)            # bottom 5 records

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
95,Sub-Saharan Africa,Mali,Clothes,Online,M,7/26/2011,512878119,9/3/2011,888,109.28,35.84,97040.64,31825.92,65214.72
96,Asia,Malaysia,Fruits,Offline,L,11/11/2011,810711038,12/28/2011,6267,9.33,6.92,58471.11,43367.64,15103.47
97,Sub-Saharan Africa,Sierra Leone,Vegetables,Offline,C,6/1/2016,728815257,6/29/2016,1485,154.06,90.93,228779.10,135031.05,93748.05
98,North America,Mexico,Personal Care,Offline,M,7/30/2015,559427106,8/8/2015,5767,81.73,56.67,471336.91,326815.89,144521.02
99,Sub-Saharan Africa,Mozambique,Household,Offline,L,2/10/2012,665095412,2/15/2012,5367,668.27,502.54,3586605.09,2697132.18,889472.91

In [16]:
### Accessing data from dataframe
df

  Name  Age       City
0  Kri   25  bangalore
1  joh   30      Delhi
2  jac   45     jaipur

In [17]:
df['Name']

0    Kri
1    joh
2    jac
Name: Name, dtype: object

In [18]:
df.loc[0]      # to access a row use loc

Name          Kri
Age            25
City    bangalore
Name: 0, dtype: object

In [ ]:
df.iloc[0][0]       # iloc - index location

In [21]:
## Accessing a specified element
df['Name']

0    Kri
1    joh
2    jac
Name: Name, dtype: object

In [22]:
df

  Name  Age       City
0  Kri   25  bangalore
1  joh   30      Delhi
2  jac   45     jaipur

In [ ]:
# Accessing a specified element
print(df.at[1,'Age'])

30

In [28]:
df.iat[2,2]

'jaipur'

In [32]:
## Data manipulation with dataframe
# adding a column 
df['Salary']=[500,600,700]
df

  Name  Age       City  Salary
0  Kri   25  bangalore     500
1  joh   30      Delhi     600
2  jac   45     jaipur     700

In [34]:
## remove a column
df.drop('Salary',axis=1,inplace=True)     # axis = 1 for it to check columns where salary attribute is present

# inplace = true so it deletes the salary column permanently , if u wont write it then it will again appear when u df

In [35]:
df

  Name  Age       City
0  Kri   25  bangalore
1  joh   30      Delhi
2  jac   45     jaipur

In [36]:
# add age to the column by +1
df['Age']=df['Age']+1
df

  Name  Age       City
0  Kri   26  bangalore
1  joh   31      Delhi
2  jac   46     jaipur

In [37]:
df.drop(0,inplace=True)

In [38]:
df

  Name  Age    City
1  joh   31   Delhi
2  jac   46  jaipur